infos = {
    "sanguo": {
        "filenum": 120,
        "keyword": "历史演义/三国演义"
    },
    "xiyou": {
        "filenum": 101,
        "keyword": "鬼怪神魔/西游记"
    },
    "honglou": {
        "filenum": 120,
        "keyword": "世态人情/红楼梦"
    },
    "shuihu": {
        "filenum": 121,
        "keyword": "英雄传奇/水浒传"
    }
}

prompts = {
    "sanguo": [
        "且说董卓字仲颖，陇西临洮人也，官拜河东太守，自来骄傲。",
        "且说曹操当日对何进曰：“宦官之祸，古今皆有；但世主不当假之权宠，使至于此。",
        "且说董卓欲杀袁绍，李儒止之曰：“事未可定，不可妄杀。”",
        "却说陈宫临欲下手杀曹操，忽转念曰：“我为国家跟他到此，杀之不义。不若弃而他往。”",
        "却说张飞拍马赶到关下，关上矢石如雨，不得进而回。"
    ],
    "xiyou": [
        "话表美猴王得了姓名，怡然踊跃；对菩提前作礼启谢。",
        "却说美猴王荣归故里，自剿了混世魔王，夺了一口大刀，逐日操演武艺，"
        "那太白金星与美猴王，同出了洞天深处，一齐驾云而起。",
        "话表齐天大圣到底是个妖猴，更不知官衔品从，也不较俸禄高低，但只注名便了。",
        "话表齐天大圣被众天兵押去斩妖台下，绑在降妖柱上，刀砍斧剁，枪刺剑刳，莫想伤及其身。"
    ],
    "honglou": [
        "却说封肃听见公差传唤，忙出来陪笑启问。那些人只嚷：“快请出甄爷来！”",
        "却说雨村忙回头看时，不是别人，乃是当日同僚一案参革的张如圭。",
        "却说黛玉同姐妹们至王夫人处，见王夫人正和兄嫂处的来使计议家务，又说姨母家遭人命官司等语。",
        "如今且说林黛玉自在荣府以来，贾母万般怜爱，寝食起居一如宝玉，迎春、探春、惜春三个亲孙女倒且靠后了。",
        "却说秦氏因听见宝玉梦中唤他的乳名，心中纳闷，又不好细问。彼时宝玉迷迷惑惑，若有所失，遂起身，解怀整衣。"
    ],
    "shuihu": [
        "话说当时史进道：“却怎生是好？”　　朱武等三个头领跪下道：“哥哥，你是干净的人，休为我等连累了。",
        "话说当下鲁提辖纽过身来看时，拖扯的不是别人，却是渭州酒楼上救了的金老。",
        "话说当日智真长老道：“智深，你此间决不可住了。我有一个师弟，见在东京大相国寺住持，唤做智清禅师。",
        "话说鲁智深走过数个山坡，见一座大松林，一条山路。随着那山路行去，走不得半里，",
        "话说那酸枣门外三二十个泼皮破落户中间，有两个为头的，一个叫做过街老鼠张三，一个叫做青草蛇李四。"
    ]
}